## Q1: SQL-ODATA Knesset

In [1]:
import sqlite3
import pandas as pd

In [2]:
prefix='https://knesset.gov.il/Odata/ParliamentInfo.svc/KNS_IsraelLawMinistry()' # Table URL - KNS_IsraelLawMinistry

In [3]:
df = pd.read_xml(prefix, xpath='//*[contains(name(),"m:properties")]')
df.head()

   LawMinistryID  IsraelLawID  GovMinistryID          LastUpdatedDate
0        2135419      2000001              4  2014-09-10T14:27:17.383
1        2135420      2000002             18  2014-09-10T14:27:17.383
2        2135421      2000005            426  2014-09-10T14:27:17.383
3        2135422      2000006             21  2014-09-10T14:27:17.383
4        2135423      2000007             13  2014-09-10T14:27:17.383

In [4]:
table_name = "sql_tbl" # table and file name
con = sqlite3.connect('{}.sqlite'.format(table_name)) # creates file
df.to_sql(table_name, con, if_exists='replace', index=False) # writes to file
cursor=con.execute("SELECT * FROM sql_tbl LIMIT 5") # # sql query to display top4 data from table
for r in cursor: print(r)
con.close()  # close the connection

(2135419, 2000001, 4, '2014-09-10T14:27:17.383')
(2135420, 2000002, 18, '2014-09-10T14:27:17.383')
(2135421, 2000005, 426, '2014-09-10T14:27:17.383')
(2135422, 2000006, 21, '2014-09-10T14:27:17.383')
(2135423, 2000007, 13, '2014-09-10T14:27:17.383')